
# принцип добавления в словарь
example = {
    "one":1,
    "two":2,
    "three":3
}


example.update({"four":4})
# print (example)

# принцип добавления класса 
class Dog():
    def __init__(self,age) -> None:
        self.age = age 
    

dog1 = Dog(23)
# print (dog1.age)

# принцип  работы yield
import time

def lazy_warehouse():
    print ("начинаю рабочий день")
    resource = "📦 КОРОБКА"
    yield resource
    print (1)
    print (2)
    print (3)



l = lazy_warehouse()
print(next(l)) # Создали, он спит
try:
    next(l)
except StopIteration:
    pass
    # print("Все, работник ушел домой")


"""
yield работает таким образом что  ты функция доходит до  этапа yield  и ждет, пока ей дадут сигнал еще раз
чтобы она выполнила дейтсвией после yield, если делать через try finally  то finally выполнится в любом случае
после yield
"""



# def try_test_Try_Finally(Is_food_bad):
#     print ("прихожу в рестик")
#     try:
#         print ("заказал суп на завоз")
#         if (Is_food_bad==True):
#             print ("суп не вкусный")
#             raise Exception("🤢 СУП ОТРАВЛЕН! Нам плохо!") 
#         # выбрасываем ошибку
#         print(" Доели десерт, все вкусно.")
#     except Exception  as e :
#         # здесь мы ее ловим как е 
#         print(f"!!! ОШИБКА ПЕРЕХВАЧЕНА: {e}")
#     finally:
#         print( "платим в любом случае даже если суп кринж ")


# try_test_Try_Finally(True)


#Принцип работы лямда функции
# lambda аргументы: выражение
testing  = lambda x:x**2
print ( testing(5))

users = [
    {'name': 'Иван', 'age': 25},
    {'name': 'Вася', 'age': 18},
    {'name': 'Петя', 'age': 40}
]

# Напишите лямбду, которая "достает" возраст
sorted_users = sorted(users, key=lambda x: x["age"]<20 )
print (sorted_users)

